{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 500,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "l": 1,
      "a": 2,
      "g": 3,
      "v": 4,
      "e": 5,
      "s": 6,
      "d": 7,
      "k": 8,
      "i": 9,
      "t": 10,
      "r": 11,
      "p": 12,
      "n": 13,
      "f": 14,
      "q": 15,
      "y": 16,
      "h": 17,
      "m": 18,
      "w": 19,
      "c": 20,
      "x": 21,
      "b": 22,
      "j": 23,
      "o": 24,
      "u": 25,
      "z": 26
    },
    "unk_token": "[UNK]"
  }
}